import 'package:bowsala/models/appLocatizations.dart';
import 'package:bowsala/widgets/appbaractions.dart';
import 'package:flutter/material.dart';



class Terms extends StatefulWidget {
  @override
  _TermsState createState() => _TermsState();
}

class _TermsState extends State<Terms> {
  @override
  Widget build(BuildContext context) {
    return Scaffold(
      appBar: AppBar(
        elevation: 0.0,
        backgroundColor: Colors.white,
        iconTheme: IconThemeData(color: Color(0xff046169), size: 20.0),
        title: Text(
          AppLocalizations.of(context).translate('terms&Conditions'),
            style: TextStyle(color: Color(0xff046169), fontSize: 20.0, fontWeight: FontWeight.bold, fontFamily: 'upper', fontStyle: FontStyle.italic),
        ),
        actions: [
          Languages(),
          SignOut(),
        ],
      ),
      backgroundColor: Colors.white,
      body: Container(
        margin: EdgeInsets.all(15.0),
        child: ListView(
          scrollDirection: Axis.vertical,
          children: [
            Column(
                children: [
                  Container(
                    width: MediaQuery.of(context).size.width/2,
                    height: 100.0,
                    margin: EdgeInsets.only(bottom: 20.0),
                    decoration: BoxDecoration(
                      image: DecorationImage(
                        image: AssetImage('assets/logo.png'),
                        fit: BoxFit.fill
                      ),
                    ),
                  ),
                ],
              ),
            description(
              '''
              تفاصيل شروط والتزامات مقدم الخدمة، والمستفيد
              ''',
              '''
              عند التوقيع على طلب شحن المنقولات يوافق المرسل ويقر باطلاعه وفهمه وموافقته على كافة الشروط الواردة أدناه، وتحدد هذه الشروط الضوابط والأحكام والنتائج المترتبة على قيام شركة بوصله (ويشار إليها فيما بعد بوصله) بشحن المنقولات:
              '''
            ),
            description(
              '''
              وثيقة النقل (البوليصة):
              ''',
              '''
              أ. يقر المرسل بأن المنقولات مملوكة له ملكيه تامة أو مصرح له بنقلها والتوقيع نيابة عن مالكها الأصلي على كافة هذه الشروط، ويتحمل المرسل وحده مسئولية أي ضرر أو تكاليف أو مصاريف إضافية تحملتها بوصله بسبب دقة البيانات المسجلة في وثيقة النقل.
ب. يجب على المرسل ملء كافة البيانات المدونة على اللاصق ووثيقة النقل بمعرفته ويتأكد من صحة العناوين وبوصله غير مسئولة عن التأخير أو التلف أو الفقد الناتج عن مخالفة المرسل لذلك، كما يجب على المرسل توضيح عدد ونوع المنقولات والطرق والاحتياطات اللازمة التي يجب على الناقل الأخذ بها عند نقل تلك المنقولات طبقاً للقواعد المرعية في هذا الشأن، ويكون المرسل مسؤولاً أمام بوصله والغير عن أي ضرر يترتب على عدم دقة وصحة وكفاية المعلومات التي يجب أن تسجل في وثيقة النقل.
ج. إن توقيع المرسل على بوليصة الشحن دون أي ملاحظات أو تحفظ إقراراً منه بصحة ما ورد فيها من بيانات.
              '''
            ),
            description(
              '''
              شروط المنقول/ المنقولات:
              ''',
              '''
              أولاً: المواد التي لا يجوز نقلها:
              أ‌. المواد الممنوعة أو الخطرة أو المحظور تداولها شرعاً وقانوناً وتشمل على سبيل المثال لا الحصر:
              المخدرات والمسكرات بأنواعها.
              النقد المحلي أو الأجنبي بأنواعه مثل (الذهب-الفضة-المعادن النفيسة).
              المفرقعات والأسلحة بأنواعها.
              المطبوعات والمواد الممنوعة التي تتنافي مع الشرع والتقاليد والأخلاق والآداب العامة والنظم والقوانين السعودية.
              ب‌. المواد ذات القيمة غير العادية كالأعمال الفنية أو الأحجار الكريمة أو المعادن أو الاثار وغيرها.
              ت‌. الأوراق التجارية كالشيكات وكالأسهم المالية أو الفواتير او الصكوك أو دفاتر الحسابات أو بطاقات ائتمان أو سندات الخزانة والسندات والمستندات أو الأختام لا المواد المتعلقة بنزاعات أو قضايا أو خلافها.
              ث‌. المواد القابلة للفساد بسبب الحرارة.
              ج‌. الحيوانات كالخيول الأصيلة والماشية والقطط وخلافها.
              المواد التي لا يجوز نقلها إلا بعقد خاص وتشمل على سبيل المثال لا الحصر:

              أ. المواد الخطرة كالسموم والأحماض.
              ب. أسطوانات الغاز المضغوط والبطاريات السائلة.
              ت. السوائل القابلة للاشتعال والاحتراق.
              ث. المواد الثمينة كالتحف والحلي والمجوهرات والساعات وأجهزة الهاتف النقال وبطاقات الاتصال مسبوقة الدفع.
              جـ. الكاميرات والتلفزيونات والراديو ومسجلات الكاسيت والفيديو ومثيلات هذه الأشياء.
              حــ. المواد الهشة والقابلة للكسر التي تحتاج إلى مزيد عناية في نقلها.
              خــ. المواد التي تبلغ قيمتها (500) ريال وأعلى.
              د. المواد الطبية التي تحتاج عناية خاصة والمواد التي تحتاج إلى تبريد.
              المواد الغذائية القابلة للتلف في ظروف النقل العادية.
              '''
            ),
            description(
              '''
              رفض نقل المنقولات
              ''',
              '''
              أ‌. لشركة بوصله الحق الكامل في رفض نقل أي منقولات وفقاً لتقديرها الخاص اواذا وجدت اسباب نظامية منعتها من تقديم الخدمة
              ب‌. تحتفظ شركه بوصله بحقها برفض نقل المنقولات في أي وقت وحتى بعد قبولها لها مع إبلاغ المرسل بذلك إذا كان يمكن للمنقولات أن تسبب أي تأخير أو ضرر لشحنات أخرى أو كانت محظورة وفقاً للقوانين المعتبرة أو لهذه الشروط.
              فتح المنقولات:
              أ‌. يحق لشركة بوصله -في حال وجود شك -تفتيش المنقولات وفتحها للتأكد من كونها قابلة للشحن.
              ب. لشركة بوصله الحق أيضاً في فتح المنقولات بعد استلامها في حالة طلب السلطات المختصة بذلك، وتعتبر بيانات بوصله بشأن ذلك سنداً يعتد به.
              فقد أو تلف المنقولات:
              يحق للمرسل والمرسل إليه في حالة وجود تلف بالمنقولات مطالبة بوصله كتابياً بالتعويض خلال يوم عمل من استلام المنقولات، وفي حال مرور الوقت المشار إليه دون المطالبة بالتعويض فيعد ذلك تنازلاً وإخلاء كامل لمسئولية بوصله عن التعويض، ويتم التعويض في حال إقراره وفقاً للأحكام الواردة في المادة الثامنة من هذه الشروط.
              '''
            ),
            description(
              '''
              التسليم:
              ''',
              '''
              أ‌. يكون وقت ومكان تسليم الشحنة هما الوقت والمكان المتفق عليهما في بوليصة الشحن، وفي حال عدم تحديد وقت ومكان تسليم الشحنة فيكون الوقت والمكان حسب ما تقضيبه العادات أو الممارسات أو الأعراف المرعية في المهنة مع الأخذ في الاعتبار الظروف التي قد تؤدي إلى أي تأخير.
              ب‌. مع الاخذ في الاعتبار الأحكام الواردة في المادة السابعة من هذه الشروط فإن شركة بوصله غير مسئولة عن أي تأخير في التسليم أو تسليم خاطئ أو ضرر أو ضياع المنقولات إذا حدث ذلك بسبب خارج عن إرادتها أو بسبب المرسل نتيجة انتهاكه للشروط المذكورة في هذه البوليصة أو طبيعة المنقولات أو لظروف طارئة أو قوى قاهرة.
              ت‌. إن تسليم المنقولات للمرسل إليه يعتبر دليلاً على تسليمها طبقاً للوصف المبين في وثيقة النقل، ما لم يتم تسليم إخطار كتابي من قبل المرسل إليه متضمناً طبيعة الخسارة أو التلف الحاصل للمنقولات خلال يوم عمل من استلامها.
              ث‌. إذا كان الاستلام من فروع بوصلة ولم يتم استلام المنقولات من قبل المرسل إليه خلال 17 يوما من تاريخ وصول المنقولات إلى مدينة المرسل إليه فإنه يحق للشركة التصرف بالمنقولات دون أدنى مسئولية عليها ولا يحق للمرسل أو المرسل إليه المطالبة بالتعويض جراء ذلك.
              ج‌. في حالة تسلم المرسل اليه البضاعة دون تحفظ فانه يسقط حقه في الرجوع على الناقل بالتأخير مالم يرسل هذا التحفظ الى الناقل خلال 21 يوما من التسليم.
              ح‌. تحتفظ شركة بوصله بسجل موثق يقيد ويحفظ فيه الاجراءات التي تمت للتعامل مع المواد البريدية التي تعذر تسليمها وذلك لمدة لا تقل عن سنة ميلادية من تاريخ الاجراء المتخذ.
              خ‌. تطبق شركة بوصله الإجراءات والقواعد المتبعة المعلنة على منصاتها ومنافذ تقديم الخدمة لديها مع المواد البريدية التي تعذر تسليمها لأصحابها بسبب رفض المرسل اليه استلامها أو لاي سبب اخر من قبل المستفيد مع مراعاة هذه القواعد عدد المحاولات الواجب ان تتم لأجراء التسليم وموافقة هذه القواعد والإجراءات للقواعد الدولية المتبعة في هذا الشأن.
              '''
            ),
            description(
              '''
              الخصوصية :
              ''',
              '''
              : تلتزم شركة بوصله بالحفاظ على سرية معلومات المستفيد من الخدمات البريدية وحمايتها من التعدي عليها باي وسيلة ،واتخاذ كافة التدابير اللازمة لمنع الوصول اليها أو الاضطلاع عليها أو افشائها او نشرها أو تعديلها بما يخالف الانظمة ، كما وتلتزم شركة بوصله بعدم الافصاح عن معلومات المستفيدين مالم يكن هذا الافصاح مسموحا به بموجب مسوغ نظامي وفقا للأنظمة المعمول بها في المملكة ،او بناء على موافقة المستفيد الصريحة ، أو من يمثله رسميا في ذلك ، او بناء على توجيه من الهيئة ، كما وتقيد أي اضطلاع علي معلومات المستفيدين لديها وتوثق أي دخول على معلوماتهم، وتحدد وتعرف طلب اغراض جمع وحفظ معلومات المستفيدين ،كما وتحافظ على محتوى المواد البريدية وتحظر على غير المصرح لهم نظاما بالاضطلاع عليها .
              '''
            ),
            description(
              '''
              الالتزامات والمسئوليات:
              ''',
              '''
                أ‌. يجب ان تكون البضائع المشحونة محكمة الإغلاق من قبل المرسل ومغلفة بطريقة جيدة تسمح بالنقل والمناولة ويتحمل المرسل وحده كافة المسئولية في حال ضياع أو ضرر للمنقولات نتيجة سوء التغليف، وإذا كانت طبيعة البضاعة تقتضي إعدادها للنقل إعداداً خاصاً وجب على المرسل القيام بذلك على نحو يحميها من الهلاك ولا يعرض الأشخاص أو الأشياء الأخرى للضرر ويكون مسؤولاً عن أي ضرر ينتج عن مخالفته لهذا الالتزام.
                ب‌. يتحمل المرسل المسئولية الكاملة لأي ضرر أو خسارة أو مصاريف إضافية تتكبدها شركة بوصله ويشمل ذلك مصاريف التخزين والبالغة قيمتها (2) ريالاً عن اليوم الواحد ويبدأ حساب هذه القيمة بعد مرور 24 ساعة من آخر موعد لاستلامها حسب المادة 6 فقرة ث.
                ت‌. في حال حدوث أضرار أو تلفيات أو تأخير لإحدى رحلات شركة بوصله بسبب نوع ومحتوى المنقولات فإن المرسل والمرسل إليه متضامنين في تحمل المسئولية تجاه تعويض بوصله أو الغير عن الأضرار.
                ث‌. يحق للمستفيد من الخدمات البريدية تقديم شكواه لشركة بوصله في مدة اقصاها 120 يوما من تاريخ ايداع المواد البريدية
                ج‌. يحق لشركة بوصله الرجوع على المستفيد من الخدمة البريدية باي مقابل مالي دفعته نيابة عن المستفيد والمتعلق بالخدمة محل التعاقد، بعد اخذ موافقة المستفيد المسبقة على ذلك، وتقديم ما يثبت دفع المبلغ للجهات الحكومية.
                ح‌. تلتزم شركة بوصله بمعالجة شكوى المستفيدين من الخدمة البريدية خلال 10 ايام من تاريخ تقديم الشكوى ، وتقوم بإرسال رسالة نصية  ((SMS او الكترونية او ورقية حول معالجة شكواهم، كما وتزودهم بأرقام مرجعية لشكاواهم ،وتشعرهم بمستجدات معالجة شكاواهم والمدة الجديدة المتوقعة لأنهائها، مع مراعاة المدة المحددة لمعالجة الشكوى .
                خ‌. تلتزم شركة بوصله بحفظ شكوى المستفيد من الخدمة البريدية وجميع الاجراءات التي تمت عليها لمدة سنة ميلادية من تاريخ اغلاق الشكوى
                د‌. تلتزم شركة بوصله بمعالجة شكاوى المستفيدين من الخدمات البريدية عبر نظام إلكتروني تحفظ فيه وتوثق إجراءات معالجة الشكوى من بداية تقديمها وحتى إغلاقها.
                ذ‌. يجب على أي مستفيد قدمت اليه مواد بريدية لا تخصه، أو عثر عليها ان يبلغ شركة بوصله عن طريق احدى وسائل التواصل المعتمدة.
                ر‌. تلتزم شركة بوصله بحفظ عقود الخدمات البريدية المقدمة للمستفيدين لمدة لا تقل عن سنة ميلادية، ويكون عبء اثبات موافقة المستفيد عند وجود أي نزاع على شركة بوصلة وحدها.
                ز‌. يحق لشركة بوصلة إتلاف المنقولات وتفريغها وسحبها في حال اقتضت الضرورة ذلك دون أن تتحمل أي تعويض للمرسل إزاء هذا العمل.
                س‌. تستحق شركة بوصله أجرة النقل عما يتأخر أو يهلك من البضاعة المشحونة بسبب قوة قاهرة أو بخطأ من المرسل أو المرسل إليه أو وكلائهما أو ممثليهما أو بسبب عيب كامن أو خفي في البضاعة أو بسبب حدوث نقص في الحجم أو الوزن أثناء النقل لأسباب تعود إلى طبيعة البضاعة المنقولة مثل التبخر أو الجفاف أو النضوج أو بأي سبب آخر يكون خارج سيطرة بوصله ويمنعها من تنفيذ بنود العقد، وتكون بوصله معفية من المسئولية في جميع هذه الحالات.
                ش‌. إن الشحن من خلال شركة بوصله غير مشمول بالتأمين وأن أقصى قيمة للبضائع المرسلة لوثيقة النقل الواحدة لا تتجاوز مبلغ 500 ريال وأنه في حال عدم ذكر ثمن البضاعة على البوليصة من قبل العميل وتقديم الفواتير الدالة على القيمة المذكورة على وثيقة النقل قبل الشروع في إرسالها فيعتبر ذلك بمثابة الموافقة على أن البضاعة قيمتها أقل من 500 ريال.
                ص‌. في حال فقدان أو تلف المنقولات وهلاكها أو تضررها بسبب شركة بوصله فإن حدود مسئولية شركة بوصله يجب ألا تزيد بأي حال من الأحوال عما يعادل 50% بما لا يتجاوز 250 ريال.
                ض‌. في حال حدوث تأخير في تسليم المنقولات عن موعدها المتفق عليه بين الطرفين وكانت شركة بوصله مسئولة عن التأخير فإن حدود مسئولية شركة بوصله تتحمل اجرة النقل الواجب دفعها عن الاجزاء المتأخرة وشريطة أن يتقدم المرسل او المرسل إليه بإخطار كتابي خلال ثلاثة أيام من استلام المنقولات للمطالبة بالتعويض.
                ط. في حال ثبوت أضرار غير مباشرة بسبب  شركة بوصله ناتجة عن تلف وتضرر كل أو بعض المنقولات أو فقدها أو التأخير في تسليمها عن الموعد المتفق عليه كتعطل عجلة الإنتاج أو وصول البضاعة في غير موسمها أو فوات الأرباح أو انخفاض القيمة السوقية للمنقولات فإن حدود مسئولية شركة بوصله تكون محدودة عن هذه الاضرار بحيث لا تزيد عن قيمة اجرة النقل شريطة أن يتقدم المرسل أو المرسل إليه بإخطار كتابي خلال ثلاثة أيام من استلام المنقولات للمطالبة بالتعويض ، مع العلم بأنه في حال قيام شركة بوصله بتعويض المرسل عن الأضرار المباشرة فإن مسئوليتها تعد معفاة وبصورة كاملة عن الأضرار غير المباشرة وتعد داخلة ضمناً في التعويض عن الأضرار المباشرة.
                يقر ويوافق المرسل على إعفاء شركة بوصله من المسئولية كاملة في الحالات الآتية:
                أ‌. مرور يوم عمل منذ استلام المرسل إليه للمنقولات المرسلة وتوقيعه على استلامها.
                ب‌. تأخير أو رفض المرسل إليه استلام المنقولات لمدة تزيد عن 17 يوماً من تاريخ وصول المنقولات لمدينة المرسل إليه.
                ت‌. الفقد أو التلف أو التأخير الناتج عن خطأ المرسل.
                ث‌. الفقد أو التلف مما يكون بسبب العث والهوام والبلى ونتيجة الاستخدام والتلف التدرجي وانكسار الأشياء الهشة.
                ج‌. الفقد أو التلف بسبب الحوادث المرورية بغض النظر عن المتسبب بها.
                ح‌. الفقد أو التلف بسبب السرقة إذا كانت من خارج موظفي بوصله، وأما إذا كانت السرقة من موظفي بوصله فإن مسئولية بوصله تقتصر على ما ورد في البند السابع الفقرة (خ).
                خ‌. الفقد أو التلف أو التأخير الخارج عن إرادة بوصله كالقوة القاهرة والتي تشمل على سبيل المثال الاضطراب بوسائل النقل البري أو الجوي نظراُ لسوء الأحوال الجوية أو اندلاع الحرائق أو الفيضانات أو الحروب أو المنازعات أو الاضطرابات الأمنية أو القرارات الحكومية أو المشاكل العمالية أو الالتزامات التي يمتد تأثيرها على بوصله.
                أحكام عامة:
                أ. تسري الشروط والتعليمات المذكورة أعلاه على كافة المنقولات والإرساليات.
                ب‌. أحكام هذه البوليصة هي الأساس في التعاقد، وفي حال التعاقد الخاص فتبقى أحكام هذه البوليصة سارية فيما لا يتعارض مع أحكام العقد الخاص.
                ت‌. هذه البوليصة جزء لا يتجزأ من الأنظمة ذات العلاقة المعمول بها في المملكة العربية السعودية وتلغى جميع ما يتعارض معها من أحكام.
              '''
            ),
            description(
              '''
              سياسات وإجراءات التعويضات
              ''',
              '''
              للعميل حق الشكوى لمده 120 يوم من تاريخ ارسال الشحنة
              حق التعويض يكون لمرسل الشحنة
              في حاله رغبه المرسل في التنازل عن التعويض للمستلم يكون عن طريق وكاله شرعيه
              التعويض بقيمه المثل وفقا للائحة هيئه الاتصالات ويتوجب على المرسل توفير الاوراق المطلوبة للتعويض و هي كآلاتي:
              فاتورة اصليه بقيمه المنتج
              صوره البوليصة
              حساب بنكي
              وتعتذر شركة بوصله عن التعويض في حاله عدم توافر أي من المتطلبات السابقة

              في حالات التلف يحق للمستلم اثبات التلف خلال 24 ساعة من الاستلام وارفاق صور تثبت حاله الشحنة التالفة، في حال شكوى العميل بعد الوقت المتفق عليه، تعتذر شركة بوصله عن قبول الشكوى
              في حالات تأخير التسليم عن الوقت المتفق عليه، يتم تعويض العميل بقيمه الشحن ما عدا الحالات الناتجة عن تأخير بسبب خارج عن الإرادة او ظروف طارئه او قوى قاهره.
              '''
            ),
            description(
              '''
              الاثآر المترتبة على إخلال، أو عدم تنفيذ مقدم الخدمة أو المستفيد لالتزاماته
              ''',
              '''
              شركة بوصله تكون مسؤولة عن الخسارة الناتجة عن تلف او فقد الطرود وكذلك عن التأخير في التسليم اذا وقع الحادث الذي سبب التلف أو الفقد أو التأخير في التسليم في الوقت الذي كانت فيه الطرود في عهدة بوصله الا اذا ثبت عدم صدور أي خطا أو اهمال من بوصله أو عن أي من موظفيه أو من وكلائه تسبب أو ساهم في تأخير تسليم الطرود أو خسارتها أو تلفها .كما يمكن اعفاء بوصله من المسؤولية اذا ثبت أن تأخير تسليم البضاعة أو تلفها كليا أو جزئيا يعود الى خطأ صادر عن المرسل أو المرسل اليه أو وكلائهما أو ممثليهما ، أو بسبب قوة قاهرة ،أو بسبب عيب كامن أو خفي في البضاعة. وتعفي أيضا من المسؤولية أذا حدث نقص في الحجم أو الوزن لأسباب تعود الى طبيعة البضاعة مثل الجفاف أو النضج، أو لأي سبب اخر خارج عن سيطرة بوصله ويمنعه من تنفيذ بنود عقد النقل.
              بوصله غير مسؤولة عن التأخر في تسليم البضاعة أو تلفها أو فقدها إذا كان ذلك نتج عن تقديم المرسل بيانات أو معلومات خاطئة عن طبيعة البضاعة في عقد النقل أو وثيقة النقل ويتحمل المرسل كافة الخسائر والاضرار في حالة عدم تقديمه المستندات الكافية والبيانات والمعلومات أو عدم صحتها أو عدم مطابقتها للواقع.
              شركة بوصله غير مسؤولة عما يلحق البضاعة بحكم طبيعتها من نقص في الحجم أو الوزن أثناء النقل، على ان لا يزيد هذا النقص عن النسبة المقررة طبقا للقواعد العامة المعتمدة في نقل مثل هذه البضاعة، وإذا كانت البضاعة مقسمة الى مجموعات أو طرود وكان وزن كل منها مبينا في الوثيقة، فيحدد النقص المسموح به على اساس وزن كل مجموعة أو طرد كل على حدة
              تلتزم شركة بوصله باستيفاء المبالغ التي اشترطها الطرفان (شركة بوصله والمرسل) بموجب عقد النقل استيفاؤها من المرسل اليه لحساب المرسل عند التسليم، وإذا تم تسليم البضاعة دون استيفاء تلك المبالغ فتلتزم بوصله بدفع تلك المبالغ الى المرسل دون الاخلال بحقها في الرجوع على المرسل اليه.
              شركة بوصله مسؤولة مسؤولية كاملة عن محتويات الطرود التي تقوم بنقلها وتلتزم بكافة المسؤوليات المترتبة على ذلك.
              إذا اقتضي الامر قيام شركة بوصله بفحص الطرود عند استلامها بحضور المرسل أو من ينوب عنه للتأكد من محتوياتها وتطلب ذلك فض الاغلفة او فتح الاوعية، وجب على بوصله ارجاع الاغلفة والاوعية الى ما كانت عليه، ولشركة بوصلة الحق في تحميل المرسل أو المرسل اليه قيمة ما انفقت حسب مقتضى الحال وطبقا للتكاليف السائدة.
              يكون المرسل مسؤولا عن أي ضرر يلحق بشركة بوصله إذا ثبت أن هذا الضرر نتج عن خطأ أو اهمال أو تقصير من المرسل أو موظفيه أو وكلائه.
              إذا كانت طبيعة البضاعة محل النقل تقتضي اعدادا خاصا للنقل وجب على المرسل القيام بذلك على نحو يحميها من الهلاك أو التلف ولا يعرض الاشخاص أو الاشياء التي تنقل معها للضرر، ويكون المرسل مسؤولا عن الاضرار التي تنشأ بسبب اخلاله بهذا الالتزام، وتكون بوصله مسؤولة عن الاخلال بهذا الالتزام إذا علمت بعدم قيام المرسل بواجب الاعداد الخاص أو اهماله فيه وقامت بعملية النقل.
              للمرسل ان يطلب من شركة بوصله بعد تسلمها البضائع بالتوقف عن مباشرة النقل واعادتها اليه، أو بتوجيهها الى شخص اخر غير المرسل اليه أو الى مكان اخر غير المكان المتفق عليه في وثيقة النقل، أو غير ذلك من التعليمات مادامت البضاعة في حيازة الشركة على أن يدفع المرسل اجرة ما تم من النقل وما ترتب من مصروفات وتعويض ما يلحق بوصله من ضرر بسبب تنفيذ التعليمات الجديدة، ولشركة بوصله الامتناع عن تنفيذ التعليمات الجديدة في الحالات الاتية:
              إذا لم يتم تسليم النسخة الاصلية من وثيقة النقل الخاصة بالمرسل مبينا فيها تلك التعليمات مع تعهده وتوقيعه بتسديد المصروفات الاضافية التي تترتب عليها وتعويض الاضرار التي قد تنجم عن تنفيذها.
              إذا كانت تتعارض مع التزامات بوصله الاخرى وتؤثر سلبا على سير اعمالها، وعلى بوصله اخطار المرسل أو المرسل اليه بذلك مباشرة بعد تسلمها للتعليمات وتسجيل هذا الامتناع على نسخة وثيقة النقل والا كانت مسؤولة عن الخسائر والاضرار الناجمة عن ذلك.
              عند وصول الطرود او البضاعة الى مقصدها يجب على المرسل اليه ان يقبل تسلم البضاعة، وله حق التحقق من سلامتها فاذا امتنعت الشركة عن تمكينه من ذلك جاز له رفض تسلم البضاعة.
              بتسلم المرسل اليه الطرود دون تحفظ يسقط الحق في الرجوع على الشركة بسبب التلف او الهلاك الجزئي، مالم يثبت المرسل اليه حالة البضاعة خلال ثلاثين يوما من تاريخ التسليم ويكون اثبات حالة البضاعة بمعرفة مختصين من الجهة الحكومية المعنية أو خبير تعينه المحكمة المختصة.
              يتسلم المرسل اليه البضاعة أو الطرد دون تحفظ يسقط الحق في الرجوع على الشركة بالتأخير في الوصول مالم يرسل التحفظ الى الشركة خلال (21) يوما من تاريخ التسليم.
              بصرف النظر عن أي اتفاق مخالف، إذا كان المرسل اليه مسؤولا عن سداد اجرة النقل كان من حق الشركة حجز البضاعة الى ان يتم دفع اجرة النقل واجرة تخزين البضاعة وغرامة التأخير وتعويضات الحجز وجميع ما تتكبده الشركة بشأن البضاعة من تكاليف اخري واجبة الدفع واي تعويضات مستحقة للناقل بمقتضى وثيقة النقل.
              '''
            ),
            description(
              '''
              قواعد وإجراءات طلب إعادة المواد البريدية
              ''',
              '''
              في حال طلب العميل اعاده الشحنة: رسوم اعاده الشحنة هي نفس رسوم الشحن التي دفعها العميل قبل شحن شحنته.
              تعديل العنوان المرسل إليه: إذا كان التعديل في نفس المدينة يكون التعديل مجانا وإذا كان تحويل لمدينه اخرى، ستكون في هذه الحالة بمثابة شحنه جديده والمرسل يجب عليه زيارة أقرب فرع من فروع بوصله لدفع رسوم التحويل.
              '''
            ),
            description(
              '''
              إجراءات التعامل مع شكاوى المستفيدين
              ''',
              '''
              التحقق من صلاحيه قبول شكوى العميل وفقا للائحة هيئه الاتصالات وشركة بوصله.
              فتح بلاغ واعطاء العميل رقم البلاغ.
              متابعه البلاغ من قبل الادارات المعنية.
              استلام افاده سواء سلبيه او ايجابيه.
              ابلاغ العميل بالإفادة برسالة نصية بالإجراءات التي تمت لمعالجة شكواه.
              سيتم معالجة الشكوى خلال فترة زمنية مقدارها 10 ايام عمل بأذن الله.
              في حاله التعويض يتم ابلغ العميل بالأوراق المطلوبة.
              '''
            ),
            description(
              '''
              قواعد وإجراءات التعامل مع المواد التي تعذر تسليمها
              ''',
              '''
              ابلاغ العميل والنص في عقد الخدمة بان فترة وجود الشحنة في وجهتها النهائية 17 يوما وبعدها سيتم احتساب أي مبالغ اضافية مثل اجرة التخزين، وقيمة النقل، وقيمة التوصيل في حال قام العميل بطلبها.
              التواصل مع العميل المستلم لتخييره بين استلام الشحنة عن طريق الفرع او عن طريق التوصيل (مع توضيح قيمة الفاتورة اجمالا بما فيها قيمة نقل وتوصيل وخلافه).
              في حالة عدم التجاوب من قبل المستلم بعد مضي الفترة المذكورة يتم التواصل مع المرسل لإرجاع الشحنات اليه برسوم النقل بالإضافة الى تقديم خدمة التوصيل اليه.
              في حالة عدم تجاوب العميل المرسل او المستلم يقوم موظفو خدمة العملاء بفتح تذكرة بحالة الشحنة على النظام، ويتم ارسال هذه ال تذكرة لقسم العمليات لعمل ما يلزم لتحديث حالتها على النظام.
              يتم عمل بوليصة جديدة برقم جديد للشحنات المتجهة لمخزن الشحنات المهجورة ويكون رقم البوليصة القديمة كمرجع في البوليصة الجديدة
              تضاف على البوليصة الجديدة قيمة بدل النقل وبدل التخزين وبدل التوصيل مع اضافة أي قيمة في البوليصة القديمة ان وجدت.
              في حالة مضي أكثر من شهر على الشحنة التي وصلت وجهتها النهائية ولم يتم طلبها من أي جهة لا المرسل ولا المستلم جاز للشركة التصرف في الشحنة على النحو التالي:
              بيعها والاحتفاظ بقيمة البضاعة لصالح من له حق التصرف فيها مع اقتطاع أي نفقات تكبدها الناقل او أي مبالغ مستحقة لاي جهة حكومية.
              الطلب الى المحكمة المختصة اثبات حالة البضاعة والاذن للشركة بتعيين حارس قضائي لحساب المرسل وعلى مسؤوليته.
              تفريغ البضاعة في أي مكان مناسب او تفريغها إذا كانت معبأة في حاويات طبقا لظروف وطبيعة البضاعة.
              التصرف في البضاعة حسبما يري الناقل ان الظروف تقتضي ذلك وفي حدود المعقول. إذا كانت معبأة في حاويات طبقا لظروف وطبيعة البضاعة
              '''
            ),
            description(
              '''
              مقدمة
              ''',
              '''
              شروط استخدام شركة يوفيلكس ufelix لشحن ونقل وتجميع البضائع والطرود عن طريق تطبيقات الهواتف الذكية تحكم الشروط والأحكام التالية إستخدامك يوفيلكس ufelix ، عن طريق التطبيقين ufelix captain, ufelix clientويكون استعراضك أو استخدامك لهذه التطبيقات بمثابة موافقة منك – نيابةً عن نفسك وعن الكيان الذي تمثله (والمُشار إليه فيما بعد إجمالاً العميل او الكابتن) – على جميع البنود والشروط الواردة أدناه. وقد تقوم يوفيلكس ufelix بإدخال تغييرات أو تعديلات مستقبلية على هذه البنود والشروط لاستخدام تطبيقاتها في أي وقت دون إشعار منها بذلك, ويكون استعراضك واستخدامك للتطبيقات الموضحة سابقا بعد ذلك بمثابة موافقة منك على هذه التغييرات
              '''
            ),
            description(
              '''
              تطبيق الكابتن :
              ''',
              '''
              الكابتن هو كل شخص يمتلك مركبة او مستأجر لمركبة ايا كان نوعها بدءا من المتوسيكل او السيارة الملاكي او السيارة التاكسي او الربع نقل او النصف نقل او الشاحنات الثقيلة او شاحنات الخدمات او الاتوبيسات..الخ ويرغب بالعمل لدى شركة يوفيلكس ufelix والذي يتعهد بتسجيل بياناته الصحيحة والحديثة وتتعامل شركة يوفيلكس ufelix بشكل مباشر مع مستخدم التطبيق متمثلا في بياناته على انه الكابتن الموجهه والمسؤول عن الاستخدام ويعتبر استخدام الكابتن لهذا التطبيق موافقة رسمية لشحن و تجميع وارسال واستلام جميع شحنات العملاء وتحصيل الاموال للشحنات المسلمة في اي بلد تعمل فيها شركة يوفيلكس ufelix .ولايمكن الغاء هذا الموافقة الا بايميل رسمي مسبق قبل 30 يوم موجهه لشركة يوفيلكس ufelix لحذف وتصفية حساب الكابتن وازالته من الخرائط .
              يتم تحديد رسوم الشحن تبعا لوزن وحجم الشحنات والمسافات بين نقاط التوصيل وتتغير هذه الرسوم في التطبيق بناءا علي العوامل السوقية والظروف الاقتصادية والتقدير المطلق لشركة يوفيلكس ufelix .ويكون للكابتن نسبة مقدرة ب% 80 من صافي ربح نقل وتوصيل الشحنات والبضائع والطرود قابلة للزيادة والنقصان بناءا علي التعاقدات مع الوكلاء ان وجودو .
              تقدم شركة يوفيلكس ufelix للكابتن خدمات اضافية مثل التأمين الطبي والتأمين على المركبة والارباح الربع والنصف سنوية وجميع تلك الخدمات راجعة لتقدير الشركة او للتعاقدات ومدى احقية الكابتن بناءا علي عدد الشحنات التي تم توصيلها ونقلها عن طريقه .
              يتحمل الكابتن كامل المسؤولية عن تلف او فقدان او اهمال او عبث حاصل للشحنات اثناء نقلها منذ استلامها من العميل وحتى تسليمها للمرسل اليه فيما عدا الامور القدرية والتي تخضع للتدقيق من قبل شركة يوفيلكس ufelix .
              تحدد شركة يوفيلكس قيم الشحن وعلي الكابتن الالتزام بالسعر الظاهر في التطبيق عند التحصيل من اي جهه.
              ستقوم شركة يوفيلكس ufelix بالمحاسبة والدفع للكابتن عن رسوم جميع الشحنات التي قام بشحنها للعملاء والتي تم تحصيل رسومها عن طريق الشركة باحدى طرق الدفع المباشرة كالتحويل بالبطاقات الائتمانية او الحولات البنكية او الشيكات. بما في ذلك الشحنات المحلية التي لم يتم تسليمها بسبب حقيقة أن العناوين على الشحنة ليست واضحة او رفض المرسل إليه قبول استلام الشحنة أوطلب العميل ارجاع الشحنة في غضون 8 ايام من تاريخ تسليم الشحنة.
              يقوم الكابتن بتسليم وسائل التغليف للعملاء ويتاكد من احكام التغليف قبل بدء عمليه التسليم .
              يمنع استخدام خدمات هذا التطبيق و اي خدمات اخري مستقبلية له بشكل غير شرعي او غير قانوني او غير اخلاقي او لاغراض مضرة او لاغراض احتيالية او لاحتيالات مصرفية او لأنشطة ارهابية او اي استخدامات اخري محظورة تبعا لقوانين البلد او البلاد التي يعمل فيها يوفيلكس ufelix ويكون استخدام الكابتن للتطبيق على مسؤوليته الشخصية دون ان تتحميل يوفيلكس ufelix باي حال من الاحوال المسؤولية تجاهه او تجاه الغير عن اي اضرار بشكل مباشر او غير مباشر او لاحق او عرضي او غير ذلك بسبب عدم القدرة عن استخدام التطبيق او محتواه بشكل صحيح
              يجوز ويسمح لشركة يوفيلكس ufelix بالافصاح واستخدام وتقديم بيانات مستخدمي هذا التطبيق لطلبات الخدمة الرسمية ، أو لتشغيل الخدمة بشكل صحيح، أو لحماية يوفليكس أو عملائها أو مورديها او للجهات الحكومية امتثالا لاوامر القانون للبلاد التي تعمل بها دون ادنى مسؤولية علي شركة يوفيلكس ufelix
              يجوز ويسمح لشركة يوفيلكس ufelix تغير او تحديث او حذف الخدمات من تطبيق الكابتن في اي وقت دون اشعار مسبق لاي جهة.
              لايجوز استخدام المحتوى كالافكار والتحليلات والتصميمات وحقوق الطبع والنشر والعلامات التجارية الخاصة بالتطبيق لانها مملوكة لشركة يوفيلكس ufelix . تخضع وتتبع هذه الشروط والأحكام قوانين البلاد التي تعمل بها شركة يوفيلكس ufelix . 
              '''
            ),
          ],
        ),
      ),
    );
  }
  description(String title, String subtitle){
    return Container(
      margin: EdgeInsets.all(5.0),
      child: ListTile(
        title: Text(
          title,
          textAlign: TextAlign.end,
          style: TextStyle(color: Color(0xffFFA800), fontSize: 20.0, fontWeight: FontWeight.bold, fontFamily: 'upper', fontStyle: FontStyle.italic),
        ),
        subtitle: Text(
          subtitle,
          textAlign: TextAlign.end,
          style: TextStyle(color: Colors.black, fontSize: 16.0, fontWeight: FontWeight.bold, fontFamily: 'lower', fontStyle: FontStyle.italic),
        ),
      ),
    );
  }
}